_posts/2019-10-07-fosdem-2020-sdn-devroom-cfp.html
---
layout: default
title: FOSDEM 2020 Software Defined Networking Devroom CFP
---

<p>
We are pleased to announce the Call for Participation for the FOSDEM 2020
Software Defined Networking devroom!
</p>

<p>
Important dates:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Nov 24th 2019</td>
<td class="org-left">Submission deadline for talk proposals</td>
</tr>

<tr>
<td class="org-left">Dec 15th 2019</td>
<td class="org-left">Announcement of the final schedule</td>
</tr>

<tr>
<td class="org-left">Feb 1st 2019</td>
<td class="org-left">Software Defined Networking devroom</td>
</tr>
</tbody>
</table>

<p>
Talks covering any projects or technologies within the networking domain are
welcome, with the only condition being that the project or technology must be
free and open source. Software Defined Networking continues to be an exciting
and growing field and FOSDEM gives an opportunity to reach a large audience of
knowledgeable, highly technical, free and open source software activists.
</p>

<div id="outline-container-org9004f09" class="outline-2">
<h2 id="org9004f09">Topics:</h2>
<div class="outline-text-2" id="text-org9004f09">
<p>
This year the devroom topics will include the following fields.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Domain</td>
<td class="org-left">IoT, Cloud, Enterprise, Service Provider, Wireless and Cellular.</td>
</tr>

<tr>
<td class="org-left">Physical</td>
<td class="org-left">low power, mesh, high throughput, low latency, optical, wireless</td>
</tr>

<tr>
<td class="org-left">Infrastructure</td>
<td class="org-left">switching, routing, load balancing, translation, authentic, crypto, detection, intercept</td>
</tr>

<tr>
<td class="org-left">Tooling</td>
<td class="org-left">libraries, frameworks, tracing, debugging, domain specific languages and extensions.</td>
</tr>

<tr>
<td class="org-left">Telemetry</td>
<td class="org-left">counters &amp; statistics, interference, analysis, automation.</td>
</tr>

<tr>
<td class="org-left">Validation</td>
<td class="org-left">performance, latency, packet manipulation &amp; fuzzing, traffic generators.</td>
</tr>

<tr>
<td class="org-left">Orchestration</td>
<td class="org-left">management, network-layer plugins and controllers.</td>
</tr>
</tbody>
</table>

<p>
This year the devroom will focus on cloud infrastructure, and the challenges of
scaling and resiliency posed by cloud deployments - what does it take to build a
fast and robust cloud native network? What does this mean in the age of
edge cloud?
</p>
</div>
</div>

<div id="outline-container-org5f4b2df" class="outline-2">
<h2 id="org5f4b2df">Suggested Projects:</h2>
<div class="outline-text-2" id="text-org5f4b2df">
<p>
A non-exhaustive representative list of the projects and topics we would like to
see on the schedule are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Frameworks</td>
<td class="org-left">DPDK, eBPF, XDP</td>
</tr>

<tr>
<td class="org-left">Switching</td>
<td class="org-left">Snabb, OpenvSwitch, Tungsten Fabric, Lagopus, FastClick</td>
</tr>

<tr>
<td class="org-left">Stacks</td>
<td class="org-left">Linux, *BSD, FD.io, F-Stack, DMM, mTCP, Seastar, YAStack</td>
</tr>

<tr>
<td class="org-left">Controllers</td>
<td class="org-left">Istio/Envoy, Network Service Mesh, Neutron, CNI, Canal, ODL, ONOS, Plumgrid, OVN, Contrail</td>
</tr>

<tr>
<td class="org-left">Edge</td>
<td class="org-left">Akraino, Openness</td>
</tr>

<tr>
<td class="org-left">Routing</td>
<td class="org-left">FRRouting, BIRD, Netopeer, Go-BGP</td>
</tr>

<tr>
<td class="org-left">Management</td>
<td class="org-left">ONAP, Open-O, ManageIQ, Juju, OpenBaton, Tacker, OSM, Ganglia, NetSNMP, PNDA.io</td>
</tr>

<tr>
<td class="org-left">Security</td>
<td class="org-left">Suricata, Snort, Zeek</td>
</tr>

<tr>
<td class="org-left">Tooling</td>
<td class="org-left">VSPerf, CSIT, TRex, Moongen, Scapy, Warp17</td>
</tr>
</tbody>
</table>

<p>
Talks should be aimed at a technical audience, but should not assume that
attendees are already familiar with your project or how it solves a given
problem. Talk proposals may cover very specific solutions to a problem, or may
be a higher level project overview for lesser known projects.
</p>
</div>
</div>

<div id="outline-container-org683308b" class="outline-2">
<h2 id="org683308b">Proposals:</h2>
<div class="outline-text-2" id="text-org683308b">
<p>
Proposals should be made through the FOSDEM Pentabarf submission tool. You do
not need to create a new Pentabarf account if you already have one from a past
year.
</p>

<p>
<a href="https://penta.fosdem.org/submission/FOSDEM20">https://penta.fosdem.org/submission/FOSDEM20</a>
</p>

<p>
Please select the "Software Defined Networking" as the <b>track</b> and ensure you
include the following information when submitting a proposal:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Section</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Person</td>
<td class="org-left">First/Last/Public Name</td>
<td class="org-left">Your name.</td>
</tr>

<tr>
<td class="org-left">Person</td>
<td class="org-left">Abstract</td>
<td class="org-left">Short bio.</td>
</tr>

<tr>
<td class="org-left">Person</td>
<td class="org-left">Photo</td>
<td class="org-left">Please provide a photo.</td>
</tr>

<tr>
<td class="org-left">Event</td>
<td class="org-left">Event Title</td>
<td class="org-left"><b>This is the title of your talk</b> - please be descriptive to encourage attendance.</td>
</tr>

<tr>
<td class="org-left">Event</td>
<td class="org-left">Abstract</td>
<td class="org-left">Short abstract of one or two paragraphs.</td>
</tr>

<tr>
<td class="org-left">Event</td>
<td class="org-left">Duration</td>
<td class="org-left">Please indicate the length of your talk; 15 min, 30 min or 45 min</td>
</tr>
</tbody>
</table>

<p>
The deadline for submissions is November 24th, 2019. FOSDEM will be held on the
weekend of February 1-2, 2020 and the Software Defined Networking devroom will
take place on Saturday, February 1, 2020. 
</p>

<p>
Please also join the devroom’s mailing list, which is the official communication
channel for the devroom:
</p>

<p>
<a href="https://lists.fosdem.org/listinfo/network-devroom">network-devroom@lists.fosdem.org</a> (subscription page)
</p>
</div>
</div>

<div id="outline-container-org095dc51" class="outline-2">
<h2 id="org095dc51">Steering Committee:</h2>
<div class="outline-text-2" id="text-org095dc51">
<p>
Ray Kinsella<br />
Thomas Monjalon<br />
Emma Foley<br />
Chris Price<br />
Charles Eckel
</p>
</div>
</div>
